#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cloudfront_waf.aws_wafv2_ip_set.ipset: Refreshing state... [id=c77087f5-0a76-4af8-b867-a6fd80a9b9cd]
module.cloudfront_waf.data.aws_caller_identity.current: Reading...
module.acm_certificate_cloudfront.aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:us-east-1:494557546769:certificate/851910b3-8c6c-49d8-8ff0-d311cdb552aa]
module.cloudfront_waf.data.aws_region.current: Reading...
module.us_east_1_kms.aws_kms_key.key: Refreshing state... [id=9bd1658e-780c-4a0f-b09d-89e78a6c95f6]
module.cloudfront_waf.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.cloudfront_waf.data.aws_caller_identity.current: Read complete after 0s [id=494557546769]
module.cloudfront_waf.data.aws_iam_policy_document.kms_policy: Reading...
module.cloudfront_waf.data.aws_iam_policy_document.kms_policy: Read complete after 1s [id=2240621774]
module.cdn.aws_cloudfront_function.remove_path: Refreshing state... [id=tlabs-prod-remove-path]
module.cdn.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E11LVK3FNF3H54]
module.cloudfront_waf.aws_kms_key_policy.kms: Refreshing state... [id=arn:aws:kms:us-east-1:494557546769:key/9bd1658e-780c-4a0f-b09d-89e78a6c95f6]
module.cloudfront_waf.aws_cloudwatch_log_group.log: Refreshing state... [id=aws-waf-logs-tlabs-prod]
module.sec_groups.data.aws_ec2_managed_prefix_list.cloudfront: Reading...
data.aws_route53_zone.domain_zone: Reading...
module.network.data.aws_region.current: Reading...
module.backup.data.aws_iam_policy_document.assume_role: Reading...
module.backup.data.aws_backup_vault.vault: Reading...
module.efs.aws_efs_file_system.efs: Refreshing state... [id=fs-0e32a31d21cbb3d2f]
module.acm_certificate.aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:ap-southeast-4:494557546769:certificate/452e1ab1-8ce1-40ff-8f2e-d1f0f2692a30]
module.website_bucket.aws_s3_bucket.website: Refreshing state... [id=tlabs-prod-website]
module.network.data.aws_region.current: Read complete after 0s [id=ap-southeast-4]
module.backup.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1497918837]
module.backup.aws_iam_role.backup_default_service_role: Refreshing state... [id=tlabs-prod-AWSBackupDefaultServiceRole]
module.network.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00dd8de9b8d44d5b3]
data.aws_route53_zone.domain_zone: Read complete after 1s [id=Z00389343FQLZJJBSELTA]
module.acm_certificate_cloudfront.aws_route53_record.app["*.tlabs.au"]: Refreshing state... [id=Z00389343FQLZJJBSELTA__5c5c650c62f9333eb5722b72b589a744.tlabs.au._CNAME]
module.acm_certificate_cloudfront.aws_route53_record.app["tlabs.au"]: Refreshing state... [id=Z00389343FQLZJJBSELTA__5c5c650c62f9333eb5722b72b589a744.tlabs.au._CNAME]
module.dns.aws_route53_record.www: Refreshing state... [id=Z00389343FQLZJJBSELTA_www_CNAME]
module.cloudfront_waf.aws_wafv2_web_acl.web_acl: Refreshing state... [id=bed0ef1e-04f7-4e16-bc92-5f7bee10b00d]
module.backup.aws_iam_role_policy_attachment.backup_service_role_for_backup_attachment: Refreshing state... [id=tlabs-prod-AWSBackupDefaultServiceRole-20250128125624854300000002]
module.acm_certificate_cloudfront.aws_acm_certificate_validation.app: Refreshing state... [id=2025-01-29 04:00:15.918 +0000 UTC]
module.acm_certificate.aws_route53_record.app["tlabs.au"]: Refreshing state... [id=Z00389343FQLZJJBSELTA__5c5c650c62f9333eb5722b72b589a744.tlabs.au._CNAME]
module.acm_certificate.aws_route53_record.app["*.tlabs.au"]: Refreshing state... [id=Z00389343FQLZJJBSELTA__5c5c650c62f9333eb5722b72b589a744.tlabs.au._CNAME]
module.backup.data.aws_backup_vault.vault: Read complete after 1s [id=tlabs-website-backup-vault]
module.backup.aws_backup_plan.backup_plan: Refreshing state... [id=169c57ca-569b-4408-85c9-2ac0f7d4fec1]
module.acm_certificate.aws_acm_certificate_validation.app: Refreshing state... [id=2025-01-29 04:00:46.903 +0000 UTC]
module.sec_groups.data.aws_ec2_managed_prefix_list.cloudfront: Read complete after 2s [id=pl-0fb7e7cfe038ae0e9]
module.backup.aws_backup_selection.backup_selection: Refreshing state... [id=66f5dde5-e669-4fa3-a8ac-bd0955cc75e4]
module.network.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-094b98ee72fe82ce4]
module.network.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07e87895a85875d26]
module.network.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-08e9ce46be7bca607]
module.network.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0ce8ad46a3d2d4ab2]
module.network.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d8828341e4bb4ff1]
module.network.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03893aa41eca9f255]
module.network.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-011490794ade4af8a]
module.network.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-05de4889c84263e16]
module.network.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0727635dbfa9edd4f]
module.network.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-01cb706cb15b02bbd]
module.network.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-090867ffaad1e812b]
module.sec_groups.aws_security_group.lb: Refreshing state... [id=sg-0f9d6b0162b62852a]
module.network.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03893aa41eca9f2551080289494]
module.network.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0baff3443bfd241b4]
module.network.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-051307cccecedd628]
module.sec_groups.aws_security_group.ec2: Refreshing state... [id=sg-096dd5b62507982ec]
module.network.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0861d893666c24032]
module.network.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-035e3d650d29c6102]
module.website_bucket.aws_s3_bucket_server_side_encryption_configuration.website_encryption: Refreshing state... [id=tlabs-prod-website]
module.website_bucket.aws_s3_bucket_public_access_block.website_block: Refreshing state... [id=tlabs-prod-website]
module.website_bucket.aws_s3_bucket_ownership_controls.website_ownership_controls: Refreshing state... [id=tlabs-prod-website]
module.website_bucket.aws_s3_bucket_lifecycle_configuration.lifecycle: Refreshing state... [id=tlabs-prod-website]
module.website_bucket.aws_s3_bucket_versioning.website_versioning: Refreshing state... [id=tlabs-prod-website]
module.sec_groups.aws_security_group.efs: Refreshing state... [id=sg-0a60ccf6001c8d273]
module.efs.aws_efs_mount_target.efs-mt["1"]: Refreshing state... [id=fsmt-03859cf6061ff0010]
module.efs.aws_efs_mount_target.efs-mt["0"]: Refreshing state... [id=fsmt-05f17fd22c9f8e67e]
module.server.aws_iam_role.wp_ec2: Refreshing state... [id=tlabs-prod-ec2-role]
module.server.aws_iam_instance_profile.wp_ec2: Refreshing state... [id=tlabs-prod-instance-profile]
module.server.aws_iam_role_policy_attachment.wp_ec2_policy_ssm: Refreshing state... [id=tlabs-prod-ec2-role-20250128121609683800000005]
module.server.aws_iam_role_policy_attachment.wp_ec2_policy_s3: Refreshing state... [id=tlabs-prod-ec2-role-20250128121609768700000006]
module.server.aws_instance.wp_ec2: Refreshing state... [id=i-01b4aab824ac18013]
module.cloudfront_waf.aws_wafv2_web_acl_logging_configuration.log: Refreshing state... [id=arn:aws:wafv2:us-east-1:494557546769:global/webacl/tlabs-prod-acl/bed0ef1e-04f7-4e16-bc92-5f7bee10b00d]
module.server.aws_eip.server_ip: Refreshing state... [id=eipalloc-03d321fea747c1ce3]
module.load_balancer.module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-4:494557546769:loadbalancer/app/tlabs-prod-alb/22a85122681d5346]
module.load_balancer.module.alb.aws_lb_target_group.this["ec2-web"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-4:494557546769:targetgroup/prod/b118778a5132bcf5]
module.load_balancer.module.alb.aws_lb_target_group_attachment.this["ec2-web"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-4:494557546769:targetgroup/prod/b118778a5132bcf5-20250213073947709500000002]
module.load_balancer.module.alb.aws_lb_listener.this["ex-https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-4:494557546769:listener/app/tlabs-prod-alb/22a85122681d5346/87c92fa7aff3ce55]
module.cdn.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E9VPOCOY2NW8V]
module.dns.aws_route53_record.ipv4: Refreshing state... [id=Z00389343FQLZJJBSELTA_tlabs.au_A]
module.policies.data.aws_iam_policy_document.website_policy: Reading...
module.policies.data.aws_iam_policy_document.website_policy: Read complete after 0s [id=1075154542]
module.policies.aws_s3_bucket_policy.access: Refreshing state... [id=tlabs-prod-website]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.cloudfront_waf.aws_kms_key_policy.kms will be updated in-place
  ~ resource "aws_kms_key_policy" "kms" {
        id                                 = "arn:aws:kms:us-east-1:494557546769:key/9bd1658e-780c-4a0f-b09d-89e78a6c95f6"
      ~ key_id                             = "9bd1658e-780c-4a0f-b09d-89e78a6c95f6" -> "arn:aws:kms:us-east-1:494557546769:key/9bd1658e-780c-4a0f-b09d-89e78a6c95f6"
        # (2 unchanged attributes hidden)
    }

  # module.sec_groups.aws_security_group.ec2 will be updated in-place
  ~ resource "aws_security_group" "ec2" {
        id                     = "sg-096dd5b62507982ec"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "210.23.159.182/32",
                ]
              - description      = "Open port SSH for the website to Telfer"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
            # (2 unchanged elements hidden)
        ]
        name                   = "tlabs-prod-ec2"
        tags                   = {
            "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
            "Application" = "tlabs"
            "Created_By"  = "Terraform"
            "Description" = "Wordpress website hosted in EC2"
            "Environment" = "prod"
            "Name"        = "tlabs-prod"
            "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
            "Type"        = "Business"
        }
        # (8 unchanged attributes hidden)
    }

  # module.server.data.aws_ami.ami will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "ami" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + last_launched_time    = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + name_regex            = "tlabs-wordpress"
      + owner_id              = (known after apply)
      + owners                = [
          + "self",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "virtualization-type"
          + values = [
              + "hvm",
            ]
        }
    }

  # module.server.data.aws_iam_policy_document.ec2_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ec2_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "ec2.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.server.aws_eip.server_ip will be updated in-place
  ~ resource "aws_eip" "server_ip" {
        id                       = "eipalloc-03d321fea747c1ce3"
      ~ instance                 = "i-01b4aab824ac18013" -> (known after apply)
        tags                     = {}
        # (17 unchanged attributes hidden)
    }

  # module.server.aws_iam_role.wp_ec2 will be updated in-place
  ~ resource "aws_iam_role" "wp_ec2" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "tlabs-prod-ec2-role"
        name                  = "tlabs-prod-ec2-role"
        tags                  = {
            "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
            "Application" = "tlabs"
            "Created_By"  = "Terraform"
            "Description" = "Wordpress website hosted in EC2"
            "Environment" = "prod"
            "Name"        = "tlabs-prod"
            "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
            "Type"        = "Business"
        }
        # (11 unchanged attributes hidden)
    }

  # module.server.aws_instance.wp_ec2 must be replaced
+/- resource "aws_instance" "wp_ec2" {
      ~ ami                                  = "ami-0b33bffe2cc256d8e" -> (known after apply) # forces replacement
      ~ arn                                  = "arn:aws:ec2:ap-southeast-4:494557546769:instance/i-01b4aab824ac18013" -> (known after apply)
      ~ availability_zone                    = "ap-southeast-4a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-01b4aab824ac18013" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0665cfa743a025d7b" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-68.ap-southeast-4.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.68" -> (known after apply)
      ~ public_dns                           = "ec2-16-26-94-231.ap-southeast-4.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "16.26.94.231" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "AMI_Repo"    = "https://github.com/tlabsau/image-wordpress"
            "Application" = "tlabs"
            "Created_By"  = "Terraform"
            "Description" = "Wordpress website hosted in EC2"
            "Environment" = "prod"
            "Name"        = "tlabs-prod"
            "Repository"  = "https://github.com/tlabsau/terraform-aws-wordpress"
            "Type"        = "Business"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "9d93a8afc8e970d6cf24cc2346ec7a77e756c449" -> "6496853686c21208f8b8cb04799133f87de091dd"
      + user_data_base64                     = (known after apply)
        # (13 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 2 -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:ap-southeast-4:494557546769:key/d4dbf794-28de-43e8-90ed-fa5a866669e8" -> (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0b52e04a02190055d" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.load_balancer.module.alb.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.load_balancer.module.alb.aws_lb_target_group_attachment.this["ec2-web"] must be replaced
-/+ resource "aws_lb_target_group_attachment" "this" {
      ~ id               = "arn:aws:elasticloadbalancing:ap-southeast-4:494557546769:targetgroup/prod/b118778a5132bcf5-20250213073947709500000002" -> (known after apply)
      ~ target_id        = "i-01b4aab824ac18013" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workflow: `Terraform Check`*